#+title: Large countries
#+options: toc:nil title:t num:nil author:nil ^:{}
#+property: header-args:python :results output :session :exports both
#+property: header-args :eval never-export
#+export_select_tags: export
#+export_exclude_tags: noexport

* Download the data from GEE

We can use =geefcc= to download forest cover change for large countries,
for example Perou (iso code "PER"). The country will be divided into
several tiles which are processed in parallel. If your computer has n
cores, n-1 cores will be used in parallel.

#+begin_src python
import os
import time

import ee
import numpy as np
from geefcc import get_fcc
import xarray as xr
import matplotlib.pyplot as plt
from matplotlib.colors import ListedColormap
import matplotlib.patches as mpatches
import cartopy.crs as ccrs
from dask.distributed import Client, LocalCluster, Lock
#+end_src

#+RESULTS:

We initialize Google Earth Engine.

#+begin_src python
# Initialize GEE
ee.Initialize(project="forestatrisk",
              opt_url="https://earthengine-highvolume.googleapis.com")
#+end_src

#+RESULTS:

We can compute the number of cores used for the computation.

#+begin_src python :results value
ncpu = os.cpu_count() - 1
ncpu
#+end_src

#+RESULTS:
: 7

We download the forest cover change data from GEE for Peru for years 2000, 2010 and 2020, using a buffer of about 10 km around the border (0.089... decimal degrees) and a tile size of 1 degree. 

#+begin_src python
start_time = time.time()
get_fcc(
    aoi="PER",
    buff=0.08983152841195216,
    years=[2000, 2010, 2020],
    source="tmf",
    tile_size=1,
    output_file="out_tmf/forest_tmf.tif",
)
end_time = time.time()
#+end_src

#+RESULTS:

We estimate the computation time to download 159 1-degree tiles using several cores. 

#+begin_src python
elapsed_time = (end_time - start_time) / 60
print('Execution time:', round(elapsed_time, 2), 'minutes')
#+end_src

#+RESULTS:
: Execution time: 1.15 minutes

